package com.javarush.task.task20.task2022;

import java.io.*;

/* 
Сериализация/десериализация Solution не работает.
Исправь ошибки не меняя сигнатуры методов и класса.
Метод main не участвует в тестировании.

Написать код проверки самостоятельно в методе main:
1) создать экземпляр класса Solution
2) записать в него данные - writeObject
3) сериализовать класс Solution - writeObject(ObjectOutputStream out)
4) десериализовать, получаем новый объект
5) записать в новый объект данные - writeObject
6) проверить, что в файле есть данные из п.2 и п.5


Требования:
4. В методе readObject(ObjectInputStream in) поле stream должно быть инициализировано новым объектом типа
FileOutputStream с параметрами(fileName, true).
*/
public class Solution implements Serializable, AutoCloseable {
    private String fileName;
    transient private FileOutputStream stream;

    public Solution(String fileName) throws FileNotFoundException {
        this.stream = new FileOutputStream(fileName);
        this.fileName = fileName;
    }

    public void writeObject(String string) throws IOException {
        stream.write(string.getBytes());
        stream.write("\n".getBytes());
        stream.flush();
    }

    private void writeObject(ObjectOutputStream out) throws IOException {
        out.defaultWriteObject();
    }

    private void readObject(ObjectInputStream in) throws IOException, ClassNotFoundException {
        in.defaultReadObject();
        stream = new FileOutputStream(this.fileName, true);
    }

    @Override
    public void close() throws Exception {
        System.out.println("Closing everything!");
        stream.close();
    }

    public static void main(String[] args) throws IOException, ClassNotFoundException {
        Solution solution = new Solution("File1.txt");
        solution.writeObject("Data");
        ObjectOutputStream objectOutputStream = new ObjectOutputStream(new FileOutputStream("File1.txt"));
        objectOutputStream.writeObject(solution);

        ObjectInputStream objectInputStream = new ObjectInputStream(new FileInputStream("File1.txt"));
        Solution newSol = (Solution) objectInputStream.readObject();
        System.out.println(newSol);


/*
1) создать экземпляр класса Solution
2) записать в него данные - writeObject
3) сериализовать класс Solution - writeObject(ObjectOutputStream out)
4) десериализовать, получаем новый объект
5) записать в новый объект данные - writeObject
6) проверить, что в файле есть данные из п.2 и п.5
*/
    }
}
