package com.javarush.task.task04.task0430;

/* 
Вывести на экран числа от 1 до 10 используя цикл while. Каждое значение с новой строки.
*/

import java.io.*;

public class Solution {
    public static void main(String[] args) throws Exception {
        int i = 1;
        while (i < 11){
            System.out.println(i);
            i++;
        }
        //напишите тут ваш код

    }
}